# Importante

- Añadir a cada grafico un texto tipo Observaciones explicando como se tiene que interpretar la información.

- Hay que terminar con conclusiones

# Introducción

El objetivo de este proyecto es la implementación de las primeras fases típicas de un proyecto de ciencia de datos, que son:
1. Recolección de datos
2. Limpieza de datos
3. Análisis de datos

## Cosas instalación previa

- python -m ipykernel install --user --name=venv_dataset_project --display-name

## Hipotesis que se desean demostrar con los datos

- Normalización de salarios con respecto al coste de vida de los países.
- ¿Cuál es el país con

# Fuentes de dataset

- Puestos de trabajos relacionados con IA: https://www.kaggle.com/datasets/bismasajjad/global-ai-job-market-and-salary-trends-2025/data
- Puestos de trabajos a nivel tecnológico: https://www.kaggle.com/datasets/yaaryiitturan/global-tech-salary-dataset

- Análisis de coste de vida: https://www.kaggle.com/datasets/myrios/cost-of-living-index-by-country-by-number-2024
- Salario promedio por países: https://www.kaggle.com/datasets/meeratif/list-of-countries-by-average-wage-monthly-yearly
- Indice de desarrollo humano: https://hdr.undp.org/data-center/documentation-and-downloads

## Cargado de datos y primera toma de contacto

In [181]:
import pandas as pd
import os

path_ai_jobs = os.path.join('data','ai_job_dataset.csv')
path_global_tech = os.path.join('data', 'global_tech_salary.txt')
path_cost_of_living = os.path.join('data', 'Cost_of_Living_Index_by_Country_2024.csv')
path_avg_salary = os.path.join('data', 'salary_data.csv')
path_idh = os.path.join('data', 'HDR25_Statistical.xlsx')

ai_job_df = pd.read_csv(path_ai_jobs, sep=',')
global_tech_df = pd.read_csv(path_global_tech, sep=',')
cost_of_life_df = pd.read_csv(path_cost_of_living, sep=',')
avg_salary_df = pd.read_csv(path_avg_salary, sep=',')
idh_df = pd.read_excel(path_idh, sheet_name='Table 1. HDI')

print('========================== OFERTAR LABORALES EN IA ===========================')
# Pasamos de snake_case a Title Case y quitamos guiones bajos
ai_job_df.columns = ai_job_df.columns.str.replace('_', ' ').str.title().str.strip()

# Renombramos la columna 'Employee Residence' a 'Country' para unificar con los otros DataFrames
ai_job_df = ai_job_df.rename(columns={'Employee Residence': 'Country'})
ai_job_df = ai_job_df.rename(columns={'Salary Usd': 'Salary USD'})
display(ai_job_df.sample(5))

print('========================== OFERTAS LABORALES A NIVEL TECNOLÓGICO GLOBAL ==========================')
global_tech_df.columns = global_tech_df.columns.str.replace('_', ' ').str.title().str.strip()

# Renombramos la columna 'Country or Area' a 'Country' para unificar con los otros DataFrames
global_tech_df = global_tech_df.rename(columns={'Employee Residence': 'Country'})
global_tech_df = global_tech_df.rename(columns={'Salary In Usd': 'Salary USD'})
display(global_tech_df.sample(5))

print('========================== COSTE DE VIDA POR PAÍSES ==========================')
display(cost_of_life_df.sample(5))

print('========================== SALARIO PROMEDIO POR PAÍSES ==========================')
# Pasamos de snake_case a Title Case y quitamos guiones bajos

avg_salary_df.columns = avg_salary_df.columns.str.replace('_', ' ').str.title().str.strip()
avg_salary_df = avg_salary_df.rename(columns={'Country Name': 'Country'})
display(avg_salary_df.sample(5))

print('========================== ÍNDICE DE DESARROLLO HUMANO (IDH) ==========================')
idh_df.columns = idh_df.columns.str.replace('_', ' ').str.title().str.strip()
idh_df = idh_df.rename(columns={'Country or Area': 'Country'})
idh_df = idh_df.rename(columns={'Human Development Index (Hdi)': 'Human Development Index'})
display(idh_df.sample(5))

========================== OFERTAR LABORALES EN IA ===========================

,Job Id,Job Title,Salary USD,Salary Currency,Experience Level,Employment Type,Company Location,Company Size,Country,Remote Ratio,Required Skills,Education Required,Years Experience,Industry,Posting Date,Application Deadline,Job Description Length,Benefits Score,Company Name
12540,AI12541,Head of AI,154717,USD,EX,CT,India,M,India,0,"Hadoop, Scala, Spark",Bachelor,14,Technology,2024-01-01,2024-03-03,1372,7.9,TechCorp Inc
3951,AI03952,Deep Learning Engineer,82628,USD,MI,CT,Ireland,L,Ireland,100,"Git, TensorFlow, Computer Vision, AWS, Tableau",Bachelor,2,Automotive,2024-08-13,2024-10-20,1649,7.1,TechCorp Inc
8196,AI08197,ML Ops Engineer,70190,EUR,EN,FT,France,L,France,0,"Mathematics, TensorFlow, Hadoop",Bachelor,1,Consulting,2024-05-13,2024-06-20,2423,9.4,Neural Networks Co
11275,AI11276,ML Ops Engineer,70668,EUR,EN,FT,Germany,L,Norway,100,"Deep Learning, Mathematics, Docker",Associate,0,Automotive,2025-03-30,2025-04-25,1448,5.8,Cloud AI Solutions
10490,AI10491,Data Engineer,154957,GBP,SE,FT,United Kingdom,M,Israel,0,"PyTorch, Java, Statistics",Associate,5,Consulting,2024-02-15,2024-03-19,1299,8.7,Machine Intelligence Group

========================== OFERTAS LABORALES A NIVEL TECNOLÓGICO GLOBAL ==========================

,Work Year,Experience Level,Employment Type,Job Title,Salary,Salary Currency,Salary USD,Country,Remote Ratio,Company Location,Company Size
240,2023,SE,FT,Data Scientist,200000,USD,200000,US,0,US,M
87,2024,SE,FT,Data Science,130300,USD,130300,US,0,US,M
2312,2022,MI,FT,Data Analyst,100000,USD,100000,US,0,US,M
4678,2024,MI,FT,Data Engineer,120000,USD,120000,US,0,US,M
724,2023,SE,FT,Data Engineer,252000,USD,252000,US,100,US,M

========================== COSTE DE VIDA POR PAÍSES ==========================

,Rank,Country,Cost of Living Index,Rent Index,Cost of Living Plus Rent Index,Groceries Index,Restaurant Price Index,Local Purchasing Power Index
35,36,Estonia,52.0,15.0,34.2,46.4,50.6,80.4
11,12,Canada,64.8,33.2,49.6,71.2,61.7,103.7
120,121,Pakistan,18.8,2.8,11.1,17.5,12.9,29.1
62,63,Chile,39.1,11.1,25.7,41.6,34.8,45.1
104,105,Bolivia,27.6,7.5,18.0,27.0,19.4,37.9

========================== SALARIO PROMEDIO POR PAÍSES ==========================

,Country,Continent Name,Wage Span,Median Salary,Average Salary,Lowest Salary,Highest Salary
106,Korea (South),Asia,Monthly,2593.42,2889.81,728.38,12893.00
204,Turks and Caicos Islands,North America,Monthly,1350.00,1490.00,380.00,6640.00
170,Saint Martin,North America,Monthly,3086.68,3477.80,877.38,15433.40
77,Greece,Europe,Monthly,2241.01,2579.28,655.39,11522.20
146,Nicaragua,Central America,Monthly,449.10,517.15,130.38,2299.95

========================== ÍNDICE DE DESARROLLO HUMANO (IDH) ==========================

,Hdi Rank,Country,Human Development Index,Life Expectancy At Birth,Expected Years Of Schooling,Mean Years Of Schooling,Gross National Income (Gni) Per Capita,Gni Per Capita Rank Minus Hdi Rank,Hdi Rank.1
59,60,Brunei Darussalam,0.837,75.327,13.698620,9.282000,75826.873380,-51,63
184,185,Sierra Leone,0.467,61.786,9.064125,3.535298,1713.727772,-3,185
40,41,Croatia,0.889,78.580,16.348150,12.095122,41379.890270,1,40
102,103,Saint Lucia,0.748,72.697,12.730410,8.614167,20899.781930,-29,102
63,64,Russian Federation,0.832,73.154,13.185150,12.410000,39221.683590,-18,61

## Datos representativos de los datasets objeto de estudio

In [182]:
summary_df = pd.DataFrame({
    'Dataset asociado': ['Puestos de trabajo IA', 'Global Tech Salary', 'Coste de vida', 'Salario promedio por países', 'Indice de Desarrollo Humano (IDH)'],
    'Número de entradas': [len(ai_job_df), len(global_tech_df), len(cost_of_life_df), len(avg_salary_df), len(idh_df)],
    'Número de columnas': [ai_job_df.shape[1], global_tech_df.shape[1], cost_of_life_df.shape[1], avg_salary_df.shape[1], idh_df.shape[1]],
    'Columnas Categóricas': [
        ai_job_df.select_dtypes(include='object').shape[1],
        global_tech_df.select_dtypes(include='object').shape[1],
        cost_of_life_df.select_dtypes(include='object').shape[1],
        avg_salary_df.select_dtypes(include='object').shape[1],
        idh_df.select_dtypes(include='object').shape[1],
    ],
    'Columnas Numéricas': [
        ai_job_df.select_dtypes(include='number').shape[1],
        global_tech_df.select_dtypes(include='number').shape[1],
        cost_of_life_df.select_dtypes(include='number').shape[1],
        avg_salary_df.select_dtypes(include='number').shape[1],
        idh_df.select_dtypes(include='number').shape[1],
    ],
        'Nulos totales': [
        ai_job_df.isnull().sum().sum(),
        global_tech_df.isnull().sum().sum(),
        cost_of_life_df.isnull().sum().sum(),
        avg_salary_df.isnull().sum().sum(),
        idh_df.isnull().sum().sum()
    ],
    'Filas duplicadas': [
        ai_job_df.duplicated().sum(),
        global_tech_df.duplicated().sum(),
        cost_of_life_df.duplicated().sum(),
        avg_salary_df.duplicated().sum(),
        idh_df.duplicated().sum()
    ],
    'Número países implicados': [
        ai_job_df['Country'].nunique(),
        global_tech_df['Country'].nunique(),
        cost_of_life_df['Country'].nunique(),
        avg_salary_df['Country'].nunique(),
        idh_df['Country'].nunique()
    ]
    })

display(summary_df)

,Dataset asociado,Número de entradas,Número de columnas,Columnas Categóricas,Columnas Numéricas,Nulos totales,Filas duplicadas,Número países implicados
0,Puestos de trabajo IA,15000,19,14,5,0,0,20
1,Global Tech Salary,5000,11,7,4,0,1144,55
2,Coste de vida,121,8,1,7,0,0,121
3,Salario promedio por países,221,7,3,4,0,0,221
4,Indice de Desarrollo Humano (IDH),193,9,2,7,0,0,193

<b>Primeras conclusiones</b>
- El dataset puestos de trabajos en IA es rico en datos teniendo 15.000 entradas y 19 columnas, lo cual, nos proporcionará una buena base para tener una visión general del mercado laboral en IA.
- Los datasets de costes de vida, salario promedio por países e índice de desarrollo humano tienen un número de entradas coherentes con el número de países que existen en el mundo, aunque hay uqe subrayar que el dataset "Coste de vida" tiene un número de entradas inferior, por lo que no se podrá hacer una comparación directa con todos los países, sino que habrá que hacer una selección de los páises que están en común entre los cuatro datasets.
- No hay valores nulos ni filas duplicadas en los datasets, lo cual es positivo para el análisis posterior.

A continuación, nos centraremos en averiguar qué países quedarán expluidos de la comparación por no tener datos en todos los datasets.

## Limpieza de datos y normalización de datos

<b>Cambios básicos</b><br>

Empezamos con una eliminación de duplicados en el dataset de puestos de trabajos en IA, ya que hay entradas duplicadas. Esto es importante para evitar sesgos en el análisis posterior. Además, ponemos los nombres de los países en minúsculas para facilitar la comparación con los otros datasets.

In [183]:
# Eliminamos duplicados y reseteamos el índice en global_tech_df
global_tech_df = global_tech_df.drop_duplicates().reset_index(drop=True)

# Ponemos nombres de países en minúsculas y sin espacios extra
ai_job_df['Country'] = ai_job_df["Country"].str.strip().str.lower()
cost_of_life_df['Country'] = cost_of_life_df["Country"].str.strip().str.lower()
avg_salary_df['Country'] = avg_salary_df["Country"].str.strip().str.lower()
idh_df['Country'] = idh_df["Country"].str.strip().str.lower()
global_tech_df['Country'] = global_tech_df["Country"].str.strip().str.lower()

<b>Nombres de países en el dataset "Global Tech Salary"</b>

Tenemos un caso especial donde los nombres de páises en el dataset "Global Tech Salary" no coinciden con los nombres de países en los otros datasets. Por ejemplo, "USA" en lugar de "united states". Para solucionar esto, crearemos un diccionario de mapeo para normalizar los nombres de países utilizando la librería de terceros "pycountry" para obtener los nombres oficiales de los países y según su código ISO.

In [184]:
import pycountry # Módulo para obtener nombres de países segun codigo
global_tech_df["Country"].unique()

def codigo_a_nombre(codigo):
    try:
        return pycountry.countries.get(alpha_2=codigo).name.strip().lower()
    except:
        return codigo
    
global_tech_df["Country"] = global_tech_df["Country"].map(codigo_a_nombre)

display(global_tech_df.sample(5))

,Work Year,Experience Level,Employment Type,Job Title,Salary,Salary Currency,Salary USD,Country,Remote Ratio,Company Location,Company Size
295,2023,MI,FT,Research Scientist,220000,USD,220000,united states,0,US,M
580,2023,MI,FT,Data Engineer,130000,USD,130000,united states,100,US,M
1892,2024,SE,FT,Machine Learning Engineer,96900,USD,96900,united states,0,US,M
3497,2023,SE,FT,Data Analyst,98000,USD,98000,united states,100,US,M
3470,2024,MI,FT,Research Engineer,96800,USD,96800,united states,0,US,M

<b>Nivel de experiencia y tipo de trabajo</b>

Continuamos expandiendo los acrónimos de los niveles de experiencia y tipos de trabajo en el dataset "Global Tech Salary". Por ejemplo, "Jr" se convierte en "Junior", "Sr" en "Senior", y así sucesivamente. Esto nos permitirá tener una mejor comprensión de los datos y facilitará el análisis posterior.

In [185]:
EXPERIENCE_LEVEL_MAP = {
    "EN": "Entry-level",
    "MI": "Mid-level",
    "SE": "Senior-level",
    "EX": "Executive-level",
}

EMPLOYMENT_TYPE_MAP = {
    "FT": "Full-time",
    "PT": "Part-time",
    "CT": "Contract",
    "FL": "Freelance",
    "IN": "Internship",
}

COMPANY_SIZE_MAP = {
    "S": "Small",
    "M": "Medium",
    "L": "Large",
}

global_tech_df['Experience Level'] = global_tech_df['Experience Level'].map(lambda  exp: EXPERIENCE_LEVEL_MAP[exp] if exp in EXPERIENCE_LEVEL_MAP else exp)
global_tech_df['Employment Type'] = global_tech_df["Employment Type"].map(lambda emp: EMPLOYMENT_TYPE_MAP[emp] if emp in EMPLOYMENT_TYPE_MAP else emp)
global_tech_df['Company Size'] = global_tech_df["Company Size"].map(lambda size: COMPANY_SIZE_MAP[size] if size in COMPANY_SIZE_MAP else size)

ai_job_df["Experience Level"] = ai_job_df["Experience Level"].map(lambda exp: EXPERIENCE_LEVEL_MAP[exp] if exp in EXPERIENCE_LEVEL_MAP else exp)
ai_job_df["Employment Type"] = ai_job_df["Employment Type"].map(lambda emp: EMPLOYMENT_TYPE_MAP[emp] if emp in EMPLOYMENT_TYPE_MAP else emp)
ai_job_df["Company Size"] = ai_job_df["Company Size"].map(lambda size: COMPANY_SIZE_MAP[size] if size in COMPANY_SIZE_MAP else size)

display(global_tech_df.sample(5))
display(ai_job_df.sample(5))

,Work Year,Experience Level,Employment Type,Job Title,Salary,Salary Currency,Salary USD,Country,Remote Ratio,Company Location,Company Size
2031,2024,Mid-level,Full-time,Data Scientist,180000,USD,180000,united states,0,US,Medium
1058,2023,Executive-level,Full-time,Director of Data Science,336400,USD,336400,united states,0,US,Medium
2807,2023,Executive-level,Full-time,Data Engineer,168000,USD,168000,united states,100,US,Medium
1387,2023,Senior-level,Full-time,Machine Learning Engineer,164000,USD,164000,united states,100,US,Medium
3544,2024,Senior-level,Full-time,Data Scientist,106875,USD,106875,united states,0,US,Medium

,Job Id,Job Title,Salary USD,Salary Currency,Experience Level,Employment Type,Company Location,Company Size,Country,Remote Ratio,Required Skills,Education Required,Years Experience,Industry,Posting Date,Application Deadline,Job Description Length,Benefits Score,Company Name
13031,AI13032,Data Engineer,132013,USD,Executive-level,Part-time,Israel,Small,israel,50,"R, PyTorch, NLP",PhD,10,Media,2024-05-27,2024-07-19,582,6.5,Autonomous Tech
10462,AI10463,Machine Learning Engineer,160697,USD,Executive-level,Freelance,China,Large,china,100,"MLOps, Python, Docker, Statistics",Master,16,Finance,2024-05-05,2024-06-30,1379,6.6,Cloud AI Solutions
7170,AI07171,AI Specialist,54590,USD,Mid-level,Freelance,Israel,Medium,united states,100,"SQL, TensorFlow, Data Visualization",Associate,4,Automotive,2025-02-14,2025-04-05,1789,5.3,DeepTech Ventures
6524,AI06525,Principal Data Scientist,88023,GBP,Entry-level,Part-time,United Kingdom,Large,netherlands,50,"Statistics, Scala, Mathematics, Computer Vision",Master,1,Transportation,2025-04-16,2025-06-03,1254,6.1,Digital Transformation LLC
4184,AI04185,AI Product Manager,109462,USD,Entry-level,Freelance,Switzerland,Large,china,0,"Scala, SQL, Deep Learning, Computer Vision",PhD,0,Finance,2025-03-21,2025-05-11,2363,8.9,Digital Transformation LLC

## Unificación de datasets
<b>Selección de información relevante para el estudio</b>

Dado que queremos hacer una unión vertical de los datasets, es necesario seleccionar las columnas que son comunes entre ellos. En este caso, las columnas relevantes son:
- "Job title" (título del trabajo).
- "Country" (país).
- "Salary In Usd" (salario): En el primer dataset cogeremos el salario normalizado a USD.
- "Nivel de experiencia" (nivel de experiencia).
- "Tipo de trabajo" (tipo de trabajo).

In [186]:
common_columns = list(set(global_tech_df.columns) & set(ai_job_df.columns))

global_tech_reduced = global_tech_df[common_columns]
ai_job_reduced = ai_job_df[common_columns]

all_tech_jobs_df = pd.concat([global_tech_reduced, ai_job_reduced], ignore_index=True)
display(all_tech_jobs_df.sample(10))

,Salary Currency,Experience Level,Employment Type,Job Title,Salary USD,Company Size,Country,Company Location,Remote Ratio
815,USD,Senior-level,Full-time,Machine Learning Infrastructure Engineer,127300,Medium,united states,US,0
2575,USD,Senior-level,Full-time,Data Analyst,82620,Medium,united states,US,0
10591,USD,Senior-level,Part-time,AI Architect,169060,Medium,switzerland,Norway,50
3945,EUR,Entry-level,Contract,AI Software Engineer,78014,Large,france,France,50
9413,USD,Entry-level,Freelance,Data Engineer,52032,Medium,japan,Japan,50
4277,USD,Entry-level,Freelance,Autonomous Systems Engineer,99795,Medium,switzerland,Switzerland,100
1740,USD,Senior-level,Full-time,Analytics Engineer,63000,Medium,united states,US,0
14260,EUR,Entry-level,Contract,Data Scientist,54699,Small,ireland,Germany,0
4054,USD,Entry-level,Part-time,AI Software Engineer,38540,Small,austria,Austria,0
342,USD,Senior-level,Full-time,Data Scientist,156000,Medium,united states,US,0

<b>Unión de datasets de coste de vida, índice de desarrollo humano y salarío promedio por país</b>

En primer lugar solo seleccionaremos los campos que nos interesan de cada dataset, tras esto procederemos a unificar los datasets de coste de vida, índice de desarrollo humano y salario promedio por país. Para ello, utilizaremos la columna "Country" como clave de unión. Esto nos permitirá tener una visión más completa de los datos y facilitará el análisis posterior.

Finalmente, eliminaremos todos aquellos países que no estén presente en la tabla de puestos de trabajos tecnológicos. Además, se ha optado por imprimir el dataset completo da

In [187]:
life_cost_reduced = cost_of_life_df[['Country', 'Cost of Living Index']]
avg_salary_reduced = avg_salary_df.drop(columns=['Continent Name', 'Wage Span'])
idh_reduced = idh_df[['Country', 'Human Development Index']]

countries_in_jobs_df = all_tech_jobs_df['Country'].unique()

indicators_by_country = pd.merge(pd.merge(life_cost_reduced, avg_salary_reduced, on='Country', how='outer'), idh_reduced, on='Country', how='outer')
indicators_by_country = indicators_by_country[indicators_by_country['Country'].isin(countries_in_jobs_df)]

display(indicators_by_country)

,Country,Cost of Living Index,Median Salary,Average Salary,Lowest Salary,Highest Salary,Human Development Index
8,argentina,29.4,110.28000,129.42000,32.57000,577.1300,0.865
9,armenia,41.0,1700.25000,1974.32000,497.39000,8780.3900,0.811
11,australia,70.2,4306.45000,4903.23000,1236.13000,21774.1900,0.958
12,austria,65.1,3572.94000,4016.91000,1014.80000,17864.6900,0.930
19,belgium,61.1,5729.39000,6522.20000,1997.89000,27378.4400,0.951
28,brazil,30.2,1490.04000,1711.16000,432.27000,7609.5600,0.786
38,canada,64.8,6311.03000,7352.94000,1850.00000,32720.5900,0.939
41,central african republic,NaN,621.99000,699.33000,175.64000,3109.9400,0.414
44,china,31.7,3684.93000,4027.40000,1015.07000,17945.2100,0.797
45,colombia,28.8,995.60000,1157.85000,292.53000,5137.7900,0.788
55,cyprus,54.7,1976.74000,2293.87000,581.40000,10211.4200,0.913
59,denmark,72.3,5084.99000,5779.04000,1458.92000,25637.3900,0.962
64,ecuador,32.6,1260.00000,1370.00000,340.00000,6080.0000,0.777
65,egypt,21.0,254.53000,298.51000,75.36000,1329.2400,0.754
69,estonia,52.0,2579.28000,2906.98000,729.39000,12896.4100,0.905
74,finland,63.2,4238.90000,4978.86000,1257.93000,22093.0200,0.948
75,france,63.7,3769.56000,4377.38000,1100.42000,19467.2300,0.920
81,germany,62.2,3731.50000,4048.63000,1014.80000,17970.4000,0.959
82,ghana,30.9,373.82000,438.42000,110.25000,1946.6000,0.628
84,greece,52.0,2241.01000,2579.28000,655.39000,11522.2000,0.908
95,honduras,NaN,1022.22000,1139.39000,287.27000,5090.9100,0.645
96,hong kong,NaN,4252.87000,4687.10000,1182.63000,20817.3700,NaN
101,india,21.2,327.97000,384.43000,97.07000,1717.9200,0.685
105,iraq,29.3,1382.38000,1573.31000,395.62000,6988.2500,0.695
106,ireland,64.4,3021.14000,3399.58000,856.24000,15151.1600,0.949
107,israel,62.7,NaN,NaN,NaN,NaN,0.919
108,italy,56.2,3467.23000,3868.92000,972.52000,17230.4400,0.915
110,japan,46.1,3158.67000,3453.12000,869.97000,15391.8200,0.925
124,latvia,49.1,1654.07270,1952.10380,491.75135,8657.8040,0.889
130,lithuania,47.1,903.87466,997.90189,251.75032,4428.3792,0.895
139,malta,52.8,4439.75000,4904.86000,1236.79000,21775.9000,0.924
145,mexico,40.2,1681.97000,1917.34000,482.78000,8495.9800,0.789
160,netherlands,63.1,4756.87000,5179.70000,1427.06000,22515.8600,0.955
163,new zealand,64.6,4196.41000,4870.06000,1227.54000,21656.2900,0.938
166,nigeria,31.4,389.85000,438.91000,110.63000,1949.2700,0.560
169,norway,76.0,4420.02000,4786.34000,1208.23000,21281.5700,0.970
171,pakistan,18.8,245.34000,284.90000,71.83000,1266.6100,0.544
179,philippines,31.0,728.78000,790.54000,199.40000,3511.5600,0.720
180,poland,40.8,1496.57000,1736.84000,437.07000,7734.5500,0.906
181,portugal,45.1,2537.00000,2917.55000,739.96000,13002.1100,0.890
185,romania,37.5,1739.87000,1921.11000,484.01000,8550.1100,0.845
187,russian federation,NaN,NaN,NaN,NaN,NaN,0.832
198,serbia,37.7,1120.04000,1273.60000,320.66000,5654.4100,0.833
201,singapore,76.7,5647.06000,6235.29000,1573.53000,27720.5900,0.946
203,slovenia,49.9,1934.46000,2093.02000,528.54000,9302.3300,0.931
206,south africa,34.5,1441.44000,1658.72000,417.59000,7366.1900,0.741
207,south korea,60.1,NaN,NaN,NaN,NaN,NaN
209,spain,47.3,2579.28000,2875.26000,877.38000,12050.7400,0.918
214,sweden,59.3,3568.16000,4144.56000,1043.00000,18389.7500,0.959
215,switzerland,101.1,9836.07000,11292.90000,2850.27000,50363.9300,0.970
222,thailand,34.1,2432.28000,2662.11000,670.31000,11846.7900,0.798
232,türkiye,NaN,NaN,NaN,NaN,NaN,0.853
234,ukraine,25.9,530.73000,622.80000,157.32000,2761.9800,0.779
235,united arab emirates,55.8,3324.25000,3896.46000,708.45000,18637.6000,0.940
236,united kingdom,62.0,6300.00000,7235.37000,1829.27000,32214.6300,0.946
237,united states,70.4,6966.00000,7925.00000,2000.00000,35250.0000,0.938
243,viet nam,NaN,NaN,NaN,NaN,NaN,0.766

## Análisis de los datos
### Análisis superficial de empleo tecnológico

In [188]:
# ¿Cuantos países únicos hay en el DataFrame combinado?
unique_countries = all_tech_jobs_df['Country'].nunique()
print("PREGUNTAS BÁSICAS")

pair_question_answer = [
    ('¿Cuántos países están implicados en el estudio?', all_tech_jobs_df['Country'].nunique()),
    ('¿Cual es el salario más alto?', round(all_tech_jobs_df['Salary USD'].max(),2)),
    ('¿Qué puesto de trabajo tiene el salario más alto?', all_tech_jobs_df[all_tech_jobs_df['Salary USD'] == all_tech_jobs_df['Salary USD'].max()]['Job Title'].unique().tolist()[0]),
    ('¿Que país tiene el salario más alto?', all_tech_jobs_df[all_tech_jobs_df['Salary USD'] == all_tech_jobs_df['Salary USD'].max()]['Country'].unique().tolist()[0]),
    ('¿Cual es el salario más bajo?', round(all_tech_jobs_df['Salary USD'].min(),2)),
    ('¿Que puesto de trabajo tiene el salario más bajo?', all_tech_jobs_df[all_tech_jobs_df['Salary USD'] == all_tech_jobs_df['Salary USD'].min()]['Job Title'].unique().tolist()[0]),
    ('¿Que país tiene el salario más bajo?', all_tech_jobs_df[all_tech_jobs_df['Salary USD'] == all_tech_jobs_df['Salary USD'].min()]['Country'].unique().tolist()[0]),
    ('¿Cual es el salario promedio?', round(all_tech_jobs_df['Salary USD'].mean(),2)),
]

job_questions_df = pd.DataFrame(pair_question_answer, columns=['Pregunta', 'Respuesta'])
job_questions_df.set_index('Pregunta', inplace=True)
display(job_questions_df)

PREGUNTAS BÁSICAS

                                                            Respuesta
Pregunta
¿Cuántos países están implicados en el estudio?                    59
¿Cual es el salario más alto?                                  750000
¿Qué puesto de trabajo tiene el salario más alto?       Data Engineer
¿Que país tiene el salario más alto?                    united states
¿Cual es el salario más bajo?                                   15000
¿Que puesto de trabajo tiene el salario más bajo?  Staff Data Analyst
¿Que país tiene el salario más bajo?                          nigeria
¿Cual es el salario promedio?                               121865.18

## Respondiendo a preguntas
### ¿Qué países salen en las ofertas de trabajo en IA?

In [189]:
print("Número de páises objeto de estudio: ", len(ai_job_df["Country"].unique()))  # Número de países únicos en el DataFrame de trabajos IA
print("Países objeto de estudio: ", ai_job_df["Country"].unique())  # Lista de países únicos en el DataFrame de trabajos IA

Número de páises objeto de estudio:  20
Países objeto de estudio:  ['china' 'ireland' 'south korea' 'india' 'singapore' 'germany'
 'united kingdom' 'france' 'austria' 'sweden' 'norway' 'israel'
 'united states' 'netherlands' 'denmark' 'switzerland' 'finland' 'japan'
 'canada' 'australia']